{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1600, 1600, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 0, "stop": 4, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 4, "stop": 8, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 8, "stop": 12, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 12, "stop": 16, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 16, "stop": 20, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 20, "stop": 24, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_7", "class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 24, "stop": 28, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_8", "class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 28, "stop": 32, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_9", "class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 32, "stop": 36, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_10", "class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 36, "stop": 40, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_11", "class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 40, "stop": 44, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_12", "class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 44, "stop": 48, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_13", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 48, "stop": 52, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_14", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 52, "stop": 56, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 56, "stop": 60, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 60, "stop": 64, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 64, "stop": 68, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 68, "stop": 72, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 72, "stop": 76, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 76, "stop": 80, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_21", "class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 80, "stop": 84, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_22", "class_name": "Lambda", "config": {"name": "lambda_22", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 84, "stop": 88, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_23", "class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 88, "stop": 92, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_24", "class_name": "Lambda", "config": {"name": "lambda_24", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 92, "stop": 96, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_25", "class_name": "Lambda", "config": {"name": "lambda_25", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 96, "stop": 100, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_26", "class_name": "Lambda", "config": {"name": "lambda_26", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 100, "stop": 104, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_27", "class_name": "Lambda", "config": {"name": "lambda_27", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 104, "stop": 108, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_28", "class_name": "Lambda", "config": {"name": "lambda_28", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 108, "stop": 112, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_29", "class_name": "Lambda", "config": {"name": "lambda_29", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 112, "stop": 116, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_30", "class_name": "Lambda", "config": {"name": "lambda_30", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 116, "stop": 120, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_31", "class_name": "Lambda", "config": {"name": "lambda_31", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 120, "stop": 124, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "lambda_32", "class_name": "Lambda", "config": {"name": "lambda_32", "trainable": true, "dtype": "float32", "function": ["4wQAAAAAAAAABAAAAAYAAABDAAAAc2IAAAB8A2QBawJyKHwAZABkAIUCZABkAIUCZABkAIUCfAF8\nAoUCZgQZAFMAfANkAmsCclB8AGQAZACFAnwBfAKFAmQAZACFAmQAZACFAmYEGQBTAHQAZAOgAXwD\noQGDAYIBZABTACkETukDAAAA6QEAAAB6J1NsaWNlIGF4aXMgc2hvdWxkIGJlIGluICgxLCAzKSwg\nZ290IHt9LikC2gpWYWx1ZUVycm9y2gZmb3JtYXQpBNoBeNoFc3RhcnTaBHN0b3DaBGF4aXOpAHIJ\nAAAA+mkvaG9tZS9yb2ZhaWRhL3B5dGhvbi1lbnZzL2VudjIvbGliL3B5dGhvbjMuNy9zaXRlLXBh\nY2thZ2VzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9tb2RlbHMvX2NvbW1vbl9ibG9ja3MucHnaDHNs\naWNlX3RlbnNvcgQAAABzCgAAAAABCAEgAQgBIAI=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"start": 124, "stop": 128, "axis": 3}}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_5", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_8", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_9", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_11", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_12", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_14", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_15", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_16", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_17", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_18", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_19", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_20", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_21", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_22", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_23", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_24", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_25", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_26", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_27", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", 