{"class_name": "Model", "config": {"name": "inception_v1", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1792, 1792, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "Conv2d_1a_7x7_conv", "class_name": "Conv2D", "config": {"name": "Conv2d_1a_7x7_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "Conv2d_1a_7x7_bn", "class_name": "BatchNormalization", "config": {"name": "Conv2d_1a_7x7_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2d_1a_7x7_conv", 0, 0, {}]]]}, {"name": "Conv2d_1a_7x7_act", "class_name": "Activation", "config": {"name": "Conv2d_1a_7x7_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Conv2d_1a_7x7_bn", 0, 0, {}]]]}, {"name": "MaxPool_2a_3x3", "class_name": "MaxPooling2D", "config": {"name": "MaxPool_2a_3x3", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Conv2d_1a_7x7_act", 0, 0, {}]]]}, {"name": "Conv2d_2b_1x1_conv", "class_name": "Conv2D", "config": {"name": "Conv2d_2b_1x1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool_2a_3x3", 0, 0, {}]]]}, {"name": "Conv2d_2b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv2d_2b_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2d_2b_1x1_conv", 0, 0, {}]]]}, {"name": "Conv2d_2b_1x1_act", "class_name": "Activation", "config": {"name": "Conv2d_2b_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Conv2d_2b_1x1_bn", 0, 0, {}]]]}, {"name": "Conv2d_2c_3x3_conv", "class_name": "Conv2D", "config": {"name": "Conv2d_2c_3x3_conv", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv2d_2b_1x1_act", 0, 0, {}]]]}, {"name": "Conv2d_2c_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv2d_2c_3x3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2d_2c_3x3_conv", 0, 0, {}]]]}, {"name": "Conv2d_2c_3x3_act", "class_name": "Activation", "config": {"name": "Conv2d_2c_3x3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Conv2d_2c_3x3_bn", 0, 0, {}]]]}, {"name": "MaxPool_3a_3x3", "class_name": "MaxPooling2D", "config": {"name": "MaxPool_3a_3x3", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Conv2d_2c_3x3_act", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_1_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3b_Branch_1_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool_3a_3x3", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_2_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3b_Branch_2_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool_3a_3x3", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_1_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3b_Branch_1_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3b_Branch_1_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_2_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3b_Branch_2_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3b_Branch_2_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_1_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_3b_Branch_1_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3b_Branch_1_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_2_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_3b_Branch_2_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3b_Branch_2_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_3_a_max", "class_name": "MaxPooling2D", "config": {"name": "Mixed_3b_Branch_3_a_max", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["MaxPool_3a_3x3", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_0_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3b_Branch_0_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool_3a_3x3", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_1_b_3x3_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3b_Branch_1_b_3x3_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3b_Branch_1_a_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_2_b_3x3_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3b_Branch_2_b_3x3_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3b_Branch_2_a_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_3_b_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3b_Branch_3_b_1x1_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3b_Branch_3_a_max", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_0_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3b_Branch_0_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3b_Branch_0_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_1_b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3b_Branch_1_b_3x3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3b_Branch_1_b_3x3_conv", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_2_b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3b_Branch_2_b_3x3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3b_Branch_2_b_3x3_conv", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_3_b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3b_Branch_3_b_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3b_Branch_3_b_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_0_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_3b_Branch_0_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3b_Branch_0_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_1_b_3x3_act", "class_name": "Activation", "config": {"name": "Mixed_3b_Branch_1_b_3x3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3b_Branch_1_b_3x3_bn", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_2_b_3x3_act", "class_name": "Activation", "config": {"name": "Mixed_3b_Branch_2_b_3x3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3b_Branch_2_b_3x3_bn", 0, 0, {}]]]}, {"name": "Mixed_3b_Branch_3_b_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_3b_Branch_3_b_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3b_Branch_3_b_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3b_Concatenated", "class_name": "Concatenate", "config": {"name": "Mixed_3b_Concatenated", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["Mixed_3b_Branch_0_a_1x1_act", 0, 0, {}], ["Mixed_3b_Branch_1_b_3x3_act", 0, 0, {}], ["Mixed_3b_Branch_2_b_3x3_act", 0, 0, {}], ["Mixed_3b_Branch_3_b_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_1_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3c_Branch_1_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3b_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_2_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3c_Branch_2_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3b_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_1_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3c_Branch_1_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3c_Branch_1_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_2_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3c_Branch_2_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3c_Branch_2_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_1_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_3c_Branch_1_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3c_Branch_1_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_2_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_3c_Branch_2_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3c_Branch_2_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_3_a_max", "class_name": "MaxPooling2D", "config": {"name": "Mixed_3c_Branch_3_a_max", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["Mixed_3b_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_0_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3c_Branch_0_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3b_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_1_b_3x3_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3c_Branch_1_b_3x3_conv", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3c_Branch_1_a_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_2_b_3x3_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3c_Branch_2_b_3x3_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3c_Branch_2_a_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_3_b_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_3c_Branch_3_b_1x1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3c_Branch_3_a_max", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_0_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3c_Branch_0_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3c_Branch_0_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_1_b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3c_Branch_1_b_3x3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3c_Branch_1_b_3x3_conv", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_2_b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3c_Branch_2_b_3x3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3c_Branch_2_b_3x3_conv", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_3_b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_3c_Branch_3_b_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_3c_Branch_3_b_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_0_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_3c_Branch_0_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3c_Branch_0_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_1_b_3x3_act", "class_name": "Activation", "config": {"name": "Mixed_3c_Branch_1_b_3x3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3c_Branch_1_b_3x3_bn", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_2_b_3x3_act", "class_name": "Activation", "config": {"name": "Mixed_3c_Branch_2_b_3x3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3c_Branch_2_b_3x3_bn", 0, 0, {}]]]}, {"name": "Mixed_3c_Branch_3_b_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_3c_Branch_3_b_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_3c_Branch_3_b_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3c_Concatenated", "class_name": "Concatenate", "config": {"name": "Mixed_3c_Concatenated", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["Mixed_3c_Branch_0_a_1x1_act", 0, 0, {}], ["Mixed_3c_Branch_1_b_3x3_act", 0, 0, {}], ["Mixed_3c_Branch_2_b_3x3_act", 0, 0, {}], ["Mixed_3c_Branch_3_b_1x1_act", 0, 0, {}]]]}, {"name": "MaxPool_4a_3x3", "class_name": "MaxPooling2D", "config": {"name": "MaxPool_4a_3x3", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Mixed_3c_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_1_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4b_Branch_1_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool_4a_3x3", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_2_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4b_Branch_2_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool_4a_3x3", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_1_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4b_Branch_1_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4b_Branch_1_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_2_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4b_Branch_2_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4b_Branch_2_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_1_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_4b_Branch_1_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4b_Branch_1_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_2_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_4b_Branch_2_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4b_Branch_2_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_3_a_max", "class_name": "MaxPooling2D", "config": {"name": "Mixed_4b_Branch_3_a_max", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["MaxPool_4a_3x3", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_0_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4b_Branch_0_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool_4a_3x3", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_1_b_3x3_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4b_Branch_1_b_3x3_conv", "trainable": true, "dtype": "float32", "filters": 208, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4b_Branch_1_a_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_2_b_3x3_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4b_Branch_2_b_3x3_conv", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4b_Branch_2_a_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_3_b_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4b_Branch_3_b_1x1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4b_Branch_3_a_max", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_0_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4b_Branch_0_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4b_Branch_0_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_1_b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4b_Branch_1_b_3x3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4b_Branch_1_b_3x3_conv", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_2_b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4b_Branch_2_b_3x3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4b_Branch_2_b_3x3_conv", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_3_b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4b_Branch_3_b_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4b_Branch_3_b_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_0_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_4b_Branch_0_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4b_Branch_0_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_1_b_3x3_act", "class_name": "Activation", "config": {"name": "Mixed_4b_Branch_1_b_3x3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4b_Branch_1_b_3x3_bn", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_2_b_3x3_act", "class_name": "Activation", "config": {"name": "Mixed_4b_Branch_2_b_3x3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4b_Branch_2_b_3x3_bn", 0, 0, {}]]]}, {"name": "Mixed_4b_Branch_3_b_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_4b_Branch_3_b_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4b_Branch_3_b_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4b_Concatenated", "class_name": "Concatenate", "config": {"name": "Mixed_4b_Concatenated", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["Mixed_4b_Branch_0_a_1x1_act", 0, 0, {}], ["Mixed_4b_Branch_1_b_3x3_act", 0, 0, {}], ["Mixed_4b_Branch_2_b_3x3_act", 0, 0, {}], ["Mixed_4b_Branch_3_b_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_1_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4c_Branch_1_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 112, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4b_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_2_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4c_Branch_2_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4b_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_1_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4c_Branch_1_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4c_Branch_1_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_2_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4c_Branch_2_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4c_Branch_2_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_1_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_4c_Branch_1_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4c_Branch_1_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_2_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_4c_Branch_2_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4c_Branch_2_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_3_a_max", "class_name": "MaxPooling2D", "config": {"name": "Mixed_4c_Branch_3_a_max", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["Mixed_4b_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_0_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4c_Branch_0_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4b_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_1_b_3x3_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4c_Branch_1_b_3x3_conv", "trainable": true, "dtype": "float32", "filters": 224, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4c_Branch_1_a_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_2_b_3x3_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4c_Branch_2_b_3x3_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4c_Branch_2_a_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_3_b_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4c_Branch_3_b_1x1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4c_Branch_3_a_max", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_0_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4c_Branch_0_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4c_Branch_0_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_1_b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4c_Branch_1_b_3x3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4c_Branch_1_b_3x3_conv", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_2_b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4c_Branch_2_b_3x3_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4c_Branch_2_b_3x3_conv", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_3_b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4c_Branch_3_b_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4c_Branch_3_b_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_0_a_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_4c_Branch_0_a_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4c_Branch_0_a_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_1_b_3x3_act", "class_name": "Activation", "config": {"name": "Mixed_4c_Branch_1_b_3x3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4c_Branch_1_b_3x3_bn", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_2_b_3x3_act", "class_name": "Activation", "config": {"name": "Mixed_4c_Branch_2_b_3x3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4c_Branch_2_b_3x3_bn", 0, 0, {}]]]}, {"name": "Mixed_4c_Branch_3_b_1x1_act", "class_name": "Activation", "config": {"name": "Mixed_4c_Branch_3_b_1x1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Mixed_4c_Branch_3_b_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4c_Concatenated", "class_name": "Concatenate", "config": {"name": "Mixed_4c_Concatenated", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["Mixed_4c_Branch_0_a_1x1_act", 0, 0, {}], ["Mixed_4c_Branch_1_b_3x3_act", 0, 0, {}], ["Mixed_4c_Branch_2_b_3x3_act", 0, 0, {}], ["Mixed_4c_Branch_3_b_1x1_act", 0, 0, {}]]]}, {"name": "Mixed_4d_Branch_1_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4d_Branch_1_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4c_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_4d_Branch_2_a_1x1_conv", "class_name": "Conv2D", "config": {"name": "Mixed_4d_Branch_2_a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4c_Concatenated", 0, 0, {}]]]}, {"name": "Mixed_4d_Branch_1_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4d_Branch_1_a_1x1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Mixed_4d_Branch_1_a_1x1_conv", 0, 0, {}]]]}, {"name": "Mixed_4d_Branch_2_a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Mixed_4d_Branch_2_a_1x1_bn", "trainable": true, "dtype": "float32", 