{"class_name": "Model", "config": {"name": "ShuffleNet_0.5X_g1_br_1_373", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "maxpool1", "class_name": "MaxPooling2D", "config": {"name": "maxpool1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "stage2/block1/1x1_gconv_1", "class_name": "Conv2D", "config": {"name": "stage2/block1/1x1_gconv_1", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool1", 0, 0, {}]]]}, {"name": "stage2/block1/bn_gconv_1", "class_name": "BatchNormalization", "config": {"name": "stage2/block1/bn_gconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block1/1x1_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block1/relu_gconv_1", "class_name": "Activation", "config": {"name": "stage2/block1/relu_gconv_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2/block1/bn_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block1/channel_shuffle", "class_name": "Lambda", "config": {"name": "stage2/block1/channel_shuffle", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAABgAAAAgAAABDAAAAc1oAAAB8AGoAoAGhAGQBZAKFAhkAXAN9An0DfQR8BHwBGgB9\nBXQCoAN8AGQDfAJ8A3wBfAVnBaECfQB0AqAEfABkBKECfQB0AqADfABkA3wCfAN8BGcEoQJ9AHwA\nUwApBeHiAQAACgogICAgUGFyYW1ldGVycwogICAgLS0tLS0tLS0tLQogICAgeDoKICAgICAgICBJ\nbnB1dCB0ZW5zb3Igb2Ygd2l0aCBgY2hhbm5lbHNfbGFzdGAgZGF0YSBmb3JtYXQKICAgIGdyb3Vw\nczogaW50CiAgICAgICAgbnVtYmVyIG9mIGdyb3VwcyBwZXIgY2hhbm5lbAoKCiAgICBSZXR1cm5z\nCiAgICAtLS0tLS0tCiAgICAgICAgY2hhbm5lbCBzaHVmZmxlZCBvdXRwdXQgdGVuc29yCgoKICAg\nIEV4YW1wbGVzCiAgICAtLS0tLS0tLQogICAgRXhhbXBsZSBmb3IgYSAxRCBBcnJheSB3aXRoIDMg\nZ3JvdXBzCgogICAgPj4+IGQgPSBucC5hcnJheShbMCwxLDIsMyw0LDUsNiw3LDhdKQogICAgPj4+\nIHggPSBucC5yZXNoYXBlKGQsICgzLDMpKQogICAgPj4+IHggPSBucC50cmFuc3Bvc2UoeCwgWzEs\nMF0pCiAgICA+Pj4geCA9IG5wLnJlc2hhcGUoeCwgKDksKSkKICAgICdbMCAxIDIgMyA0IDUgNiA3\nIDhdIC0tPiBbMCAzIDYgMSA0IDcgMiA1IDhdJwoKCiAgICDpAQAAAE7p/////ykF6QAAAAByAgAA\nAOkCAAAA6QQAAADpAwAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9k\naW1lbnNpb25zKQbaAXjaBmdyb3Vwc9oGaGVpZ2h02gV3aWR0aNoLaW5fY2hhbm5lbHNaEmNoYW5u\nZWxzX3Blcl9ncm91cKkAchIAAAD6Oi9ob21lL3JvZmFpZGEvcHl0aG9uLWVudnMvZW52Mi9uZXct\nTW9kZWxzL3NodWZmbGVuZXRfdjEucHnaD2NoYW5uZWxfc2h1ZmZsZS4BAABzDAAAAAAcGAEIAhYB\nDAEUAg==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"groups": 1}}, "inbound_nodes": [[["stage2/block1/relu_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block1/1x1_dwconv_1", "class_name": "DepthwiseConv2D", "config": {"name": "stage2/block1/1x1_dwconv_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["stage2/block1/channel_shuffle", 0, 0, {}]]]}, {"name": "stage2/block1/bn_dwconv_1", "class_name": "BatchNormalization", "config": {"name": "stage2/block1/bn_dwconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block1/1x1_dwconv_1", 0, 0, {}]]]}, {"name": "stage2/block1/1x1_gconv_2", "class_name": "Conv2D", "config": {"name": "stage2/block1/1x1_gconv_2", "trainable": true, "dtype": "float32", "filters": 60, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2/block1/bn_dwconv_1", 0, 0, {}]]]}, {"name": "stage2/block1/bn_gconv_2", "class_name": "BatchNormalization", "config": {"name": "stage2/block1/bn_gconv_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block1/1x1_gconv_2", 0, 0, {}]]]}, {"name": "stage2/block1/avg_pool", "class_name": "AveragePooling2D", "config": {"name": "stage2/block1/avg_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["maxpool1", 0, 0, {}]]]}, {"name": "stage2/block1/concat", "class_name": "Concatenate", "config": {"name": "stage2/block1/concat", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["stage2/block1/bn_gconv_2", 0, 0, {}], ["stage2/block1/avg_pool", 0, 0, {}]]]}, {"name": "stage2/block1/relu_out", "class_name": "Activation", "config": {"name": "stage2/block1/relu_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2/block1/concat", 0, 0, {}]]]}, {"name": "stage2/block2/1x1_gconv_1", "class_name": "Conv2D", "config": {"name": "stage2/block2/1x1_gconv_1", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2/block1/relu_out", 0, 0, {}]]]}, {"name": "stage2/block2/bn_gconv_1", "class_name": "BatchNormalization", "config": {"name": "stage2/block2/bn_gconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block2/1x1_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block2/relu_gconv_1", "class_name": "Activation", "config": {"name": "stage2/block2/relu_gconv_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2/block2/bn_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block2/channel_shuffle", "class_name": "Lambda", "config": {"name": "stage2/block2/channel_shuffle", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAABgAAAAgAAABDAAAAc1oAAAB8AGoAoAGhAGQBZAKFAhkAXAN9An0DfQR8BHwBGgB9\nBXQCoAN8AGQDfAJ8A3wBfAVnBaECfQB0AqAEfABkBKECfQB0AqADfABkA3wCfAN8BGcEoQJ9AHwA\nUwApBeHiAQAACgogICAgUGFyYW1ldGVycwogICAgLS0tLS0tLS0tLQogICAgeDoKICAgICAgICBJ\nbnB1dCB0ZW5zb3Igb2Ygd2l0aCBgY2hhbm5lbHNfbGFzdGAgZGF0YSBmb3JtYXQKICAgIGdyb3Vw\nczogaW50CiAgICAgICAgbnVtYmVyIG9mIGdyb3VwcyBwZXIgY2hhbm5lbAoKCiAgICBSZXR1cm5z\nCiAgICAtLS0tLS0tCiAgICAgICAgY2hhbm5lbCBzaHVmZmxlZCBvdXRwdXQgdGVuc29yCgoKICAg\nIEV4YW1wbGVzCiAgICAtLS0tLS0tLQogICAgRXhhbXBsZSBmb3IgYSAxRCBBcnJheSB3aXRoIDMg\nZ3JvdXBzCgogICAgPj4+IGQgPSBucC5hcnJheShbMCwxLDIsMyw0LDUsNiw3LDhdKQogICAgPj4+\nIHggPSBucC5yZXNoYXBlKGQsICgzLDMpKQogICAgPj4+IHggPSBucC50cmFuc3Bvc2UoeCwgWzEs\nMF0pCiAgICA+Pj4geCA9IG5wLnJlc2hhcGUoeCwgKDksKSkKICAgICdbMCAxIDIgMyA0IDUgNiA3\nIDhdIC0tPiBbMCAzIDYgMSA0IDcgMiA1IDhdJwoKCiAgICDpAQAAAE7p/////ykF6QAAAAByAgAA\nAOkCAAAA6QQAAADpAwAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9k\naW1lbnNpb25zKQbaAXjaBmdyb3Vwc9oGaGVpZ2h02gV3aWR0aNoLaW5fY2hhbm5lbHNaEmNoYW5u\nZWxzX3Blcl9ncm91cKkAchIAAAD6Oi9ob21lL3JvZmFpZGEvcHl0aG9uLWVudnMvZW52Mi9uZXct\nTW9kZWxzL3NodWZmbGVuZXRfdjEucHnaD2NoYW5uZWxfc2h1ZmZsZS4BAABzDAAAAAAcGAEIAhYB\nDAEUAg==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"groups": 1}}, "inbound_nodes": [[["stage2/block2/relu_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block2/1x1_dwconv_1", "class_name": "DepthwiseConv2D", "config": {"name": "stage2/block2/1x1_dwconv_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["stage2/block2/channel_shuffle", 0, 0, {}]]]}, {"name": "stage2/block2/bn_dwconv_1", "class_name": "BatchNormalization", "config": {"name": "stage2/block2/bn_dwconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block2/1x1_dwconv_1", 0, 0, {}]]]}, {"name": "stage2/block2/1x1_gconv_2", "class_name": "Conv2D", "config": {"name": "stage2/block2/1x1_gconv_2", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2/block2/bn_dwconv_1", 0, 0, {}]]]}, {"name": "stage2/block2/bn_gconv_2", "class_name": "BatchNormalization", "config": {"name": "stage2/block2/bn_gconv_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block2/1x1_gconv_2", 0, 0, {}]]]}, {"name": "stage2/block2/add", "class_name": "Add", "config": {"name": "stage2/block2/add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage2/block2/bn_gconv_2", 0, 0, {}], ["stage2/block1/relu_out", 0, 0, {}]]]}, {"name": "stage2/block2/relu_out", "class_name": "Activation", "config": {"name": "stage2/block2/relu_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2/block2/add", 0, 0, {}]]]}, {"name": "stage2/block3/1x1_gconv_1", "class_name": "Conv2D", "config": {"name": "stage2/block3/1x1_gconv_1", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2/block2/relu_out", 0, 0, {}]]]}, {"name": "stage2/block3/bn_gconv_1", "class_name": "BatchNormalization", "config": {"name": "stage2/block3/bn_gconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block3/1x1_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block3/relu_gconv_1", "class_name": "Activation", "config": {"name": "stage2/block3/relu_gconv_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2/block3/bn_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block3/channel_shuffle", "class_name": "Lambda", "config": {"name": "stage2/block3/channel_shuffle", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAABgAAAAgAAABDAAAAc1oAAAB8AGoAoAGhAGQBZAKFAhkAXAN9An0DfQR8BHwBGgB9\nBXQCoAN8AGQDfAJ8A3wBfAVnBaECfQB0AqAEfABkBKECfQB0AqADfABkA3wCfAN8BGcEoQJ9AHwA\nUwApBeHiAQAACgogICAgUGFyYW1ldGVycwogICAgLS0tLS0tLS0tLQogICAgeDoKICAgICAgICBJ\nbnB1dCB0ZW5zb3Igb2Ygd2l0aCBgY2hhbm5lbHNfbGFzdGAgZGF0YSBmb3JtYXQKICAgIGdyb3Vw\nczogaW50CiAgICAgICAgbnVtYmVyIG9mIGdyb3VwcyBwZXIgY2hhbm5lbAoKCiAgICBSZXR1cm5z\nCiAgICAtLS0tLS0tCiAgICAgICAgY2hhbm5lbCBzaHVmZmxlZCBvdXRwdXQgdGVuc29yCgoKICAg\nIEV4YW1wbGVzCiAgICAtLS0tLS0tLQogICAgRXhhbXBsZSBmb3IgYSAxRCBBcnJheSB3aXRoIDMg\nZ3JvdXBzCgogICAgPj4+IGQgPSBucC5hcnJheShbMCwxLDIsMyw0LDUsNiw3LDhdKQogICAgPj4+\nIHggPSBucC5yZXNoYXBlKGQsICgzLDMpKQogICAgPj4+IHggPSBucC50cmFuc3Bvc2UoeCwgWzEs\nMF0pCiAgICA+Pj4geCA9IG5wLnJlc2hhcGUoeCwgKDksKSkKICAgICdbMCAxIDIgMyA0IDUgNiA3\nIDhdIC0tPiBbMCAzIDYgMSA0IDcgMiA1IDhdJwoKCiAgICDpAQAAAE7p/////ykF6QAAAAByAgAA\nAOkCAAAA6QQAAADpAwAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9k\naW1lbnNpb25zKQbaAXjaBmdyb3Vwc9oGaGVpZ2h02gV3aWR0aNoLaW5fY2hhbm5lbHNaEmNoYW5u\nZWxzX3Blcl9ncm91cKkAchIAAAD6Oi9ob21lL3JvZmFpZGEvcHl0aG9uLWVudnMvZW52Mi9uZXct\nTW9kZWxzL3NodWZmbGVuZXRfdjEucHnaD2NoYW5uZWxfc2h1ZmZsZS4BAABzDAAAAAAcGAEIAhYB\nDAEUAg==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"groups": 1}}, "inbound_nodes": [[["stage2/block3/relu_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block3/1x1_dwconv_1", "class_name": "DepthwiseConv2D", "config": {"name": "stage2/block3/1x1_dwconv_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["stage2/block3/channel_shuffle", 0, 0, {}]]]}, {"name": "stage2/block3/bn_dwconv_1", "class_name": "BatchNormalization", "config": {"name": "stage2/block3/bn_dwconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block3/1x1_dwconv_1", 0, 0, {}]]]}, {"name": "stage2/block3/1x1_gconv_2", "class_name": "Conv2D", "config": {"name": "stage2/block3/1x1_gconv_2", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2/block3/bn_dwconv_1", 0, 0, {}]]]}, {"name": "stage2/block3/bn_gconv_2", "class_name": "BatchNormalization", "config": {"name": "stage2/block3/bn_gconv_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block3/1x1_gconv_2", 0, 0, {}]]]}, {"name": "stage2/block3/add", "class_name": "Add", "config": {"name": "stage2/block3/add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage2/block3/bn_gconv_2", 0, 0, {}], ["stage2/block2/relu_out", 0, 0, {}]]]}, {"name": "stage2/block3/relu_out", "class_name": "Activation", "config": {"name": "stage2/block3/relu_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2/block3/add", 0, 0, {}]]]}, {"name": "stage2/block4/1x1_gconv_1", "class_name": "Conv2D", "config": {"name": "stage2/block4/1x1_gconv_1", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2/block3/relu_out", 0, 0, {}]]]}, {"name": "stage2/block4/bn_gconv_1", "class_name": "BatchNormalization", "config": {"name": "stage2/block4/bn_gconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block4/1x1_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block4/relu_gconv_1", "class_name": "Activation", "config": {"name": "stage2/block4/relu_gconv_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2/block4/bn_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block4/channel_shuffle", "class_name": "Lambda", "config": {"name": "stage2/block4/channel_shuffle", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAABgAAAAgAAABDAAAAc1oAAAB8AGoAoAGhAGQBZAKFAhkAXAN9An0DfQR8BHwBGgB9\nBXQCoAN8AGQDfAJ8A3wBfAVnBaECfQB0AqAEfABkBKECfQB0AqADfABkA3wCfAN8BGcEoQJ9AHwA\nUwApBeHiAQAACgogICAgUGFyYW1ldGVycwogICAgLS0tLS0tLS0tLQogICAgeDoKICAgICAgICBJ\nbnB1dCB0ZW5zb3Igb2Ygd2l0aCBgY2hhbm5lbHNfbGFzdGAgZGF0YSBmb3JtYXQKICAgIGdyb3Vw\nczogaW50CiAgICAgICAgbnVtYmVyIG9mIGdyb3VwcyBwZXIgY2hhbm5lbAoKCiAgICBSZXR1cm5z\nCiAgICAtLS0tLS0tCiAgICAgICAgY2hhbm5lbCBzaHVmZmxlZCBvdXRwdXQgdGVuc29yCgoKICAg\nIEV4YW1wbGVzCiAgICAtLS0tLS0tLQogICAgRXhhbXBsZSBmb3IgYSAxRCBBcnJheSB3aXRoIDMg\nZ3JvdXBzCgogICAgPj4+IGQgPSBucC5hcnJheShbMCwxLDIsMyw0LDUsNiw3LDhdKQogICAgPj4+\nIHggPSBucC5yZXNoYXBlKGQsICgzLDMpKQogICAgPj4+IHggPSBucC50cmFuc3Bvc2UoeCwgWzEs\nMF0pCiAgICA+Pj4geCA9IG5wLnJlc2hhcGUoeCwgKDksKSkKICAgICdbMCAxIDIgMyA0IDUgNiA3\nIDhdIC0tPiBbMCAzIDYgMSA0IDcgMiA1IDhdJwoKCiAgICDpAQAAAE7p/////ykF6QAAAAByAgAA\nAOkCAAAA6QQAAADpAwAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9k\naW1lbnNpb25zKQbaAXjaBmdyb3Vwc9oGaGVpZ2h02gV3aWR0aNoLaW5fY2hhbm5lbHNaEmNoYW5u\nZWxzX3Blcl9ncm91cKkAchIAAAD6Oi9ob21lL3JvZmFpZGEvcHl0aG9uLWVudnMvZW52Mi9uZXct\nTW9kZWxzL3NodWZmbGVuZXRfdjEucHnaD2NoYW5uZWxfc2h1ZmZsZS4BAABzDAAAAAAcGAEIAhYB\nDAEUAg==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"groups": 1}}, "inbound_nodes": [[["stage2/block4/relu_gconv_1", 0, 0, {}]]]}, {"name": "stage2/block4/1x1_dwconv_1", "class_name": "DepthwiseConv2D", "config": {"name": "stage2/block4/1x1_dwconv_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["stage2/block4/channel_shuffle", 0, 0, {}]]]}, {"name": "stage2/block4/bn_dwconv_1", "class_name": "BatchNormalization", "config": {"name": "stage2/block4/bn_dwconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block4/1x1_dwconv_1", 0, 0, {}]]]}, {"name": "stage2/block4/1x1_gconv_2", "class_name": "Conv2D", "config": {"name": "stage2/block4/1x1_gconv_2", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2/block4/bn_dwconv_1", 0, 0, {}]]]}, {"name": "stage2/block4/bn_gconv_2", "class_name": "BatchNormalization", "config": {"name": "stage2/block4/bn_gconv_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage2/block4/1x1_gconv_2", 0, 0, {}]]]}, {"name": "stage2/block4/add", "class_name": "Add", "config": {"name": "stage2/block4/add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage2/block4/bn_gconv_2", 0, 0, {}], ["stage2/block3/relu_out", 0, 0, {}]]]}, {"name": "stage2/block4/relu_out", "class_name": "Activation", "config": {"name": "stage2/block4/relu_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage2/block4/add", 0, 0, {}]]]}, {"name": "stage3/block1/1x1_gconv_1", "class_name": "Conv2D", "config": {"name": "stage3/block1/1x1_gconv_1", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage2/block4/relu_out", 0, 0, {}]]]}, {"name": "stage3/block1/bn_gconv_1", "class_name": "BatchNormalization", "config": {"name": "stage3/block1/bn_gconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block1/1x1_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block1/relu_gconv_1", "class_name": "Activation", "config": {"name": "stage3/block1/relu_gconv_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3/block1/bn_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block1/channel_shuffle", "class_name": "Lambda", "config": {"name": "stage3/block1/channel_shuffle", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAABgAAAAgAAABDAAAAc1oAAAB8AGoAoAGhAGQBZAKFAhkAXAN9An0DfQR8BHwBGgB9\nBXQCoAN8AGQDfAJ8A3wBfAVnBaECfQB0AqAEfABkBKECfQB0AqADfABkA3wCfAN8BGcEoQJ9AHwA\nUwApBeHiAQAACgogICAgUGFyYW1ldGVycwogICAgLS0tLS0tLS0tLQogICAgeDoKICAgICAgICBJ\nbnB1dCB0ZW5zb3Igb2Ygd2l0aCBgY2hhbm5lbHNfbGFzdGAgZGF0YSBmb3JtYXQKICAgIGdyb3Vw\nczogaW50CiAgICAgICAgbnVtYmVyIG9mIGdyb3VwcyBwZXIgY2hhbm5lbAoKCiAgICBSZXR1cm5z\nCiAgICAtLS0tLS0tCiAgICAgICAgY2hhbm5lbCBzaHVmZmxlZCBvdXRwdXQgdGVuc29yCgoKICAg\nIEV4YW1wbGVzCiAgICAtLS0tLS0tLQogICAgRXhhbXBsZSBmb3IgYSAxRCBBcnJheSB3aXRoIDMg\nZ3JvdXBzCgogICAgPj4+IGQgPSBucC5hcnJheShbMCwxLDIsMyw0LDUsNiw3LDhdKQogICAgPj4+\nIHggPSBucC5yZXNoYXBlKGQsICgzLDMpKQogICAgPj4+IHggPSBucC50cmFuc3Bvc2UoeCwgWzEs\nMF0pCiAgICA+Pj4geCA9IG5wLnJlc2hhcGUoeCwgKDksKSkKICAgICdbMCAxIDIgMyA0IDUgNiA3\nIDhdIC0tPiBbMCAzIDYgMSA0IDcgMiA1IDhdJwoKCiAgICDpAQAAAE7p/////ykF6QAAAAByAgAA\nAOkCAAAA6QQAAADpAwAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9k\naW1lbnNpb25zKQbaAXjaBmdyb3Vwc9oGaGVpZ2h02gV3aWR0aNoLaW5fY2hhbm5lbHNaEmNoYW5u\nZWxzX3Blcl9ncm91cKkAchIAAAD6Oi9ob21lL3JvZmFpZGEvcHl0aG9uLWVudnMvZW52Mi9uZXct\nTW9kZWxzL3NodWZmbGVuZXRfdjEucHnaD2NoYW5uZWxfc2h1ZmZsZS4BAABzDAAAAAAcGAEIAhYB\nDAEUAg==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"groups": 1}}, "inbound_nodes": [[["stage3/block1/relu_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block1/1x1_dwconv_1", "class_name": "DepthwiseConv2D", "config": {"name": "stage3/block1/1x1_dwconv_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["stage3/block1/channel_shuffle", 0, 0, {}]]]}, {"name": "stage3/block1/bn_dwconv_1", "class_name": "BatchNormalization", "config": {"name": "stage3/block1/bn_dwconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block1/1x1_dwconv_1", 0, 0, {}]]]}, {"name": "stage3/block1/1x1_gconv_2", "class_name": "Conv2D", "config": {"name": "stage3/block1/1x1_gconv_2", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3/block1/bn_dwconv_1", 0, 0, {}]]]}, {"name": "stage3/block1/bn_gconv_2", "class_name": "BatchNormalization", "config": {"name": "stage3/block1/bn_gconv_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block1/1x1_gconv_2", 0, 0, {}]]]}, {"name": "stage3/block1/avg_pool", "class_name": "AveragePooling2D", "config": {"name": "stage3/block1/avg_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["stage2/block4/relu_out", 0, 0, {}]]]}, {"name": "stage3/block1/concat", "class_name": "Concatenate", "config": {"name": "stage3/block1/concat", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["stage3/block1/bn_gconv_2", 0, 0, {}], ["stage3/block1/avg_pool", 0, 0, {}]]]}, {"name": "stage3/block1/relu_out", "class_name": "Activation", "config": {"name": "stage3/block1/relu_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3/block1/concat", 0, 0, {}]]]}, {"name": "stage3/block2/1x1_gconv_1", "class_name": "Conv2D", "config": {"name": "stage3/block2/1x1_gconv_1", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3/block1/relu_out", 0, 0, {}]]]}, {"name": "stage3/block2/bn_gconv_1", "class_name": "BatchNormalization", "config": {"name": "stage3/block2/bn_gconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block2/1x1_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block2/relu_gconv_1", "class_name": "Activation", "config": {"name": "stage3/block2/relu_gconv_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3/block2/bn_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block2/channel_shuffle", "class_name": "Lambda", "config": {"name": "stage3/block2/channel_shuffle", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAABgAAAAgAAABDAAAAc1oAAAB8AGoAoAGhAGQBZAKFAhkAXAN9An0DfQR8BHwBGgB9\nBXQCoAN8AGQDfAJ8A3wBfAVnBaECfQB0AqAEfABkBKECfQB0AqADfABkA3wCfAN8BGcEoQJ9AHwA\nUwApBeHiAQAACgogICAgUGFyYW1ldGVycwogICAgLS0tLS0tLS0tLQogICAgeDoKICAgICAgICBJ\nbnB1dCB0ZW5zb3Igb2Ygd2l0aCBgY2hhbm5lbHNfbGFzdGAgZGF0YSBmb3JtYXQKICAgIGdyb3Vw\nczogaW50CiAgICAgICAgbnVtYmVyIG9mIGdyb3VwcyBwZXIgY2hhbm5lbAoKCiAgICBSZXR1cm5z\nCiAgICAtLS0tLS0tCiAgICAgICAgY2hhbm5lbCBzaHVmZmxlZCBvdXRwdXQgdGVuc29yCgoKICAg\nIEV4YW1wbGVzCiAgICAtLS0tLS0tLQogICAgRXhhbXBsZSBmb3IgYSAxRCBBcnJheSB3aXRoIDMg\nZ3JvdXBzCgogICAgPj4+IGQgPSBucC5hcnJheShbMCwxLDIsMyw0LDUsNiw3LDhdKQogICAgPj4+\nIHggPSBucC5yZXNoYXBlKGQsICgzLDMpKQogICAgPj4+IHggPSBucC50cmFuc3Bvc2UoeCwgWzEs\nMF0pCiAgICA+Pj4geCA9IG5wLnJlc2hhcGUoeCwgKDksKSkKICAgICdbMCAxIDIgMyA0IDUgNiA3\nIDhdIC0tPiBbMCAzIDYgMSA0IDcgMiA1IDhdJwoKCiAgICDpAQAAAE7p/////ykF6QAAAAByAgAA\nAOkCAAAA6QQAAADpAwAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9k\naW1lbnNpb25zKQbaAXjaBmdyb3Vwc9oGaGVpZ2h02gV3aWR0aNoLaW5fY2hhbm5lbHNaEmNoYW5u\nZWxzX3Blcl9ncm91cKkAchIAAAD6Oi9ob21lL3JvZmFpZGEvcHl0aG9uLWVudnMvZW52Mi9uZXct\nTW9kZWxzL3NodWZmbGVuZXRfdjEucHnaD2NoYW5uZWxfc2h1ZmZsZS4BAABzDAAAAAAcGAEIAhYB\nDAEUAg==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"groups": 1}}, "inbound_nodes": [[["stage3/block2/relu_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block2/1x1_dwconv_1", "class_name": "DepthwiseConv2D", "config": {"name": "stage3/block2/1x1_dwconv_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["stage3/block2/channel_shuffle", 0, 0, {}]]]}, {"name": "stage3/block2/bn_dwconv_1", "class_name": "BatchNormalization", "config": {"name": "stage3/block2/bn_dwconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block2/1x1_dwconv_1", 0, 0, {}]]]}, {"name": "stage3/block2/1x1_gconv_2", "class_name": "Conv2D", "config": {"name": "stage3/block2/1x1_gconv_2", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3/block2/bn_dwconv_1", 0, 0, {}]]]}, {"name": "stage3/block2/bn_gconv_2", "class_name": "BatchNormalization", "config": {"name": "stage3/block2/bn_gconv_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block2/1x1_gconv_2", 0, 0, {}]]]}, {"name": "stage3/block2/add", "class_name": "Add", "config": {"name": "stage3/block2/add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage3/block2/bn_gconv_2", 0, 0, {}], ["stage3/block1/relu_out", 0, 0, {}]]]}, {"name": "stage3/block2/relu_out", "class_name": "Activation", "config": {"name": "stage3/block2/relu_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3/block2/add", 0, 0, {}]]]}, {"name": "stage3/block3/1x1_gconv_1", "class_name": "Conv2D", "config": {"name": "stage3/block3/1x1_gconv_1", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3/block2/relu_out", 0, 0, {}]]]}, {"name": "stage3/block3/bn_gconv_1", "class_name": "BatchNormalization", "config": {"name": "stage3/block3/bn_gconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block3/1x1_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block3/relu_gconv_1", "class_name": "Activation", "config": {"name": "stage3/block3/relu_gconv_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3/block3/bn_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block3/channel_shuffle", "class_name": "Lambda", "config": {"name": "stage3/block3/channel_shuffle", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAABgAAAAgAAABDAAAAc1oAAAB8AGoAoAGhAGQBZAKFAhkAXAN9An0DfQR8BHwBGgB9\nBXQCoAN8AGQDfAJ8A3wBfAVnBaECfQB0AqAEfABkBKECfQB0AqADfABkA3wCfAN8BGcEoQJ9AHwA\nUwApBeHiAQAACgogICAgUGFyYW1ldGVycwogICAgLS0tLS0tLS0tLQogICAgeDoKICAgICAgICBJ\nbnB1dCB0ZW5zb3Igb2Ygd2l0aCBgY2hhbm5lbHNfbGFzdGAgZGF0YSBmb3JtYXQKICAgIGdyb3Vw\nczogaW50CiAgICAgICAgbnVtYmVyIG9mIGdyb3VwcyBwZXIgY2hhbm5lbAoKCiAgICBSZXR1cm5z\nCiAgICAtLS0tLS0tCiAgICAgICAgY2hhbm5lbCBzaHVmZmxlZCBvdXRwdXQgdGVuc29yCgoKICAg\nIEV4YW1wbGVzCiAgICAtLS0tLS0tLQogICAgRXhhbXBsZSBmb3IgYSAxRCBBcnJheSB3aXRoIDMg\nZ3JvdXBzCgogICAgPj4+IGQgPSBucC5hcnJheShbMCwxLDIsMyw0LDUsNiw3LDhdKQogICAgPj4+\nIHggPSBucC5yZXNoYXBlKGQsICgzLDMpKQogICAgPj4+IHggPSBucC50cmFuc3Bvc2UoeCwgWzEs\nMF0pCiAgICA+Pj4geCA9IG5wLnJlc2hhcGUoeCwgKDksKSkKICAgICdbMCAxIDIgMyA0IDUgNiA3\nIDhdIC0tPiBbMCAzIDYgMSA0IDcgMiA1IDhdJwoKCiAgICDpAQAAAE7p/////ykF6QAAAAByAgAA\nAOkCAAAA6QQAAADpAwAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9k\naW1lbnNpb25zKQbaAXjaBmdyb3Vwc9oGaGVpZ2h02gV3aWR0aNoLaW5fY2hhbm5lbHNaEmNoYW5u\nZWxzX3Blcl9ncm91cKkAchIAAAD6Oi9ob21lL3JvZmFpZGEvcHl0aG9uLWVudnMvZW52Mi9uZXct\nTW9kZWxzL3NodWZmbGVuZXRfdjEucHnaD2NoYW5uZWxfc2h1ZmZsZS4BAABzDAAAAAAcGAEIAhYB\nDAEUAg==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"groups": 1}}, "inbound_nodes": [[["stage3/block3/relu_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block3/1x1_dwconv_1", "class_name": "DepthwiseConv2D", "config": {"name": "stage3/block3/1x1_dwconv_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["stage3/block3/channel_shuffle", 0, 0, {}]]]}, {"name": "stage3/block3/bn_dwconv_1", "class_name": "BatchNormalization", "config": {"name": "stage3/block3/bn_dwconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block3/1x1_dwconv_1", 0, 0, {}]]]}, {"name": "stage3/block3/1x1_gconv_2", "class_name": "Conv2D", "config": {"name": "stage3/block3/1x1_gconv_2", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3/block3/bn_dwconv_1", 0, 0, {}]]]}, {"name": "stage3/block3/bn_gconv_2", "class_name": "BatchNormalization", "config": {"name": "stage3/block3/bn_gconv_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block3/1x1_gconv_2", 0, 0, {}]]]}, {"name": "stage3/block3/add", "class_name": "Add", "config": {"name": "stage3/block3/add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["stage3/block3/bn_gconv_2", 0, 0, {}], ["stage3/block2/relu_out", 0, 0, {}]]]}, {"name": "stage3/block3/relu_out", "class_name": "Activation", "config": {"name": "stage3/block3/relu_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3/block3/add", 0, 0, {}]]]}, {"name": "stage3/block4/1x1_gconv_1", "class_name": "Conv2D", "config": {"name": "stage3/block4/1x1_gconv_1", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["stage3/block3/relu_out", 0, 0, {}]]]}, {"name": "stage3/block4/bn_gconv_1", "class_name": "BatchNormalization", "config": {"name": "stage3/block4/bn_gconv_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stage3/block4/1x1_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block4/relu_gconv_1", "class_name": "Activation", "config": {"name": "stage3/block4/relu_gconv_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["stage3/block4/bn_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block4/channel_shuffle", "class_name": "Lambda", "config": {"name": "stage3/block4/channel_shuffle", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAABgAAAAgAAABDAAAAc1oAAAB8AGoAoAGhAGQBZAKFAhkAXAN9An0DfQR8BHwBGgB9\nBXQCoAN8AGQDfAJ8A3wBfAVnBaECfQB0AqAEfABkBKECfQB0AqADfABkA3wCfAN8BGcEoQJ9AHwA\nUwApBeHiAQAACgogICAgUGFyYW1ldGVycwogICAgLS0tLS0tLS0tLQogICAgeDoKICAgICAgICBJ\nbnB1dCB0ZW5zb3Igb2Ygd2l0aCBgY2hhbm5lbHNfbGFzdGAgZGF0YSBmb3JtYXQKICAgIGdyb3Vw\nczogaW50CiAgICAgICAgbnVtYmVyIG9mIGdyb3VwcyBwZXIgY2hhbm5lbAoKCiAgICBSZXR1cm5z\nCiAgICAtLS0tLS0tCiAgICAgICAgY2hhbm5lbCBzaHVmZmxlZCBvdXRwdXQgdGVuc29yCgoKICAg\nIEV4YW1wbGVzCiAgICAtLS0tLS0tLQogICAgRXhhbXBsZSBmb3IgYSAxRCBBcnJheSB3aXRoIDMg\nZ3JvdXBzCgogICAgPj4+IGQgPSBucC5hcnJheShbMCwxLDIsMyw0LDUsNiw3LDhdKQogICAgPj4+\nIHggPSBucC5yZXNoYXBlKGQsICgzLDMpKQogICAgPj4+IHggPSBucC50cmFuc3Bvc2UoeCwgWzEs\nMF0pCiAgICA+Pj4geCA9IG5wLnJlc2hhcGUoeCwgKDksKSkKICAgICdbMCAxIDIgMyA0IDUgNiA3\nIDhdIC0tPiBbMCAzIDYgMSA0IDcgMiA1IDhdJwoKCiAgICDpAQAAAE7p/////ykF6QAAAAByAgAA\nAOkCAAAA6QQAAADpAwAAACkF2gVzaGFwZdoHYXNfbGlzdNoBS9oHcmVzaGFwZdoScGVybXV0ZV9k\naW1lbnNpb25zKQbaAXjaBmdyb3Vwc9oGaGVpZ2h02gV3aWR0aNoLaW5fY2hhbm5lbHNaEmNoYW5u\nZWxzX3Blcl9ncm91cKkAchIAAAD6Oi9ob21lL3JvZmFpZGEvcHl0aG9uLWVudnMvZW52Mi9uZXct\nTW9kZWxzL3NodWZmbGVuZXRfdjEucHnaD2NoYW5uZWxfc2h1ZmZsZS4BAABzDAAAAAAcGAEIAhYB\nDAEUAg==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {"groups": 1}}, "inbound_nodes": [[["stage3/block4/relu_gconv_1", 0, 0, {}]]]}, {"name": "stage3/block4/1x1_dwconv_1", 