{"class_name": "Model", "config": {"name": "resnext", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_7", "class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_8", "class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_9", "class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_10", "class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_11", "class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_12", "class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_13", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_14", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_21", "class_name": "Lambda", "config": {"name": "lambda_21", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_22", "class_name": "Lambda", "config": {"name": "lambda_22", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_23", "class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_24", "class_name": "Lambda", "config": {"name": "lambda_24", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_25", "class_name": "Lambda", "config": {"name": "lambda_25", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_26", "class_name": "Lambda", "config": {"name": "lambda_26", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_27", "class_name": "Lambda", "config": {"name": "lambda_27", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_28", "class_name": "Lambda", "config": {"name": "lambda_28", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_29", "class_name": "Lambda", "config": {"name": "lambda_29", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_30", "class_name": "Lambda", "config": {"name": "lambda_30", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_31", "class_name": "Lambda", "config": {"name": "lambda_31", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_32", "class_name": "Lambda", "config": {"name": "lambda_32", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_33", "class_name": "Lambda", "config": {"name": "lambda_33", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_34", "class_name": "Lambda", "config": {"name": "lambda_34", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_35", "class_name": "Lambda", "config": {"name": "lambda_35", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_36", "class_name": "Lambda", "config": {"name": "lambda_36", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_37", "class_name": "Lambda", "config": {"name": "lambda_37", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_38", "class_name": "Lambda", "config": {"name": "lambda_38", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_39", "class_name": "Lambda", "config": {"name": "lambda_39", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_40", "class_name": "Lambda", "config": {"name": "lambda_40", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_41", "class_name": "Lambda", "config": {"name": "lambda_41", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "lambda_42", "class_name": "Lambda", "config": {"name": "lambda_42", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAc0YAAAB0AKABoQBkAWsCcjh8AGQAZACFAmQAZACFAmQAZACF\nAogAiAEUAIgAZAIXAIgBFACFAmYEGQBTAIcAhwFmAmQDZASECFMAKQVO2g1jaGFubmVsc19sYXN0\n6QEAAABjAQAAAAAAAAABAAAABgAAABMAAABzLAAAAHwAZABkAIUCiACIARQAiABkARcAiAEUAIUC\nZABkAIUCZABkAIUCZgQZAFMAKQJOcgIAAACpACkB2gF6KQLaAWPaEGdyb3VwZWRfY2hhbm5lbHNy\nAwAAAPo+L2hvbWUvcm9mYWlkYS9weXRob24tZW52cy9lbnYyL25ldy1Nb2RlbHMvZHVhbF9wYXRo\nX25ldHdvcmsucHnaCDxsYW1iZGE+IgEAAPMAAAAAej5fZ3JvdXBlZF9jb252b2x1dGlvbl9ibG9j\nay48bG9jYWxzPi48bGFtYmRhPi48bG9jYWxzPi48bGFtYmRhPikC2gFL2hFpbWFnZV9kYXRhX2Zv\ncm1hdCkBcgQAAAApAnIFAAAAcgYAAAByAwAAAHIHAAAAcggAAAAgAQAAcwQAAAAAATgB\n", null, [39, 4]], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_5", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_8", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_9", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_11", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_12", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_14", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_15", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", 